{
  "type": "annotation",
  "name": "Type",
  "qualified_name": "Type",
  "package": "",
  "modifiers": [],
  "annotations": [],
  "description": "Marks the associated method as handling an FML lifecycle event. The method must have a single parameter, one of the following types. This annotation replaces the multiple different annotations that previously were used. Current event classes. This first section is standard lifecycle events. They are dispatched at various phases as the game starts. Each event should have information useful to that phase of the lifecycle. They are fired in this order. These suggestions are mostly just suggestions on what to do in each event. FMLPreInitializationEvent : Run before anything else. Read your config, create blocks, items, etc, and register them with the GameRegistry . FMLInitializationEvent : Do your mod setup. Build whatever data structures you care about. Register recipes, send FMLInterModComms messages to other mods. FMLPostInitializationEvent : Handle interaction with other mods, complete your setup based on this. These are the server lifecycle events. They are fired whenever a server is running, or about to run. Each time a server starts they will be fired in this sequence. FMLServerAboutToStartEvent : Use if you need to handle something before the server has even been created. FMLServerStartingEvent : Do stuff you need to do to set up the server. register commands, tweak the server. FMLServerStartedEvent : Do what you need to with the running server. FMLServerStoppingEvent : Do what you need to before the server has started it's shutdown sequence. FMLServerStoppedEvent : Do whatever cleanup you need once the server has shutdown. Generally only useful on the integrated server. The second set of events are more specialized, for receiving notification of specific information. FMLFingerprintViolationEvent : Sent just before FMLPreInitializationEvent if something is wrong with your mod signature FMLInterModComms.IMCEvent : Sent just after FMLInitializationEvent if you have IMC messages waiting from other mods",
  "inheritance": {
    "extends": null,
    "implements": [],
    "inheritance_tree": []
  },
  "nested_classes": [],
  "fields": [],
  "constructors": [],
  "methods": [],
  "enum_constants": [],
  "since": null,
  "deprecated": false,
  "source_file": "Frameworks/1.10.2/net/minecraftforge/fml/common/Mod.EventHandler.html"
}